; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation5 - direction
	Star7 - direction
	Star6 - direction
	Star0 - direction
	GroundStation3 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star6)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(have_image Planet8 image1)
	(have_image Star9 thermograph0)
	(have_image Planet10 image1)
	(have_image Planet11 image1)
	(have_image Phenomenon12 thermograph0)
))

)

; plan
1. (turn_to satellite0 star0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet10)
   goals met: 0 of 6
5. (take_image satellite0 planet10 instrument0 image1)
   added: (have_image planet10 image1)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon12 instrument0 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 2 of 6
8. (turn_to satellite0 planet11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet11)
   goals met: 2 of 6
9. (take_image satellite0 planet11 instrument0 image1)
   added: (have_image planet11 image1)
   goals met: 3 of 6
10. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 3 of 6
11. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 4 of 6
12. (turn_to satellite0 star9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star9)
   goals met: 4 of 6
13. (take_image satellite0 star9 instrument0 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 5 of 6
14. (turn_to satellite1 groundstation3 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation3)
   goals met: 6 of 6
